Repository: JonEG/HighSchool
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_fe_users.xlf
Languages: es

# username.description
source: Enter the username of the website user. This is needed to login.
es: Introduzca el nombre de usuario del usuario del sitio web. Esto es necesario para acceder

# username.syntax
source: A username is required and must be in lowercase without spaces in it. The username must be unique among other usernames in the page where it's saved. If it is not unique a number will be prepended automatically.
es: Se necesita un nombre de usuario y debe estar en minúsculas y sin espacios. El nombre de usuario debe ser único en la página en la que se almacenó. Si no es único se le añadirá un número automáticamente

# _username.seeAlso
source: Creating Frontend Users and Groups | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
es: Creación de Usuarios y Grupos de Frontend | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/

# password.description
source: Enter the password for the username above. This is needed to login.
es: Introduce la clave para el nombre de usuario de arriba. Se necesita para acceder.

# password.syntax
source: A password is required and must be in lowercase without spaces in it.
es: Se necesita una clave y debe estar en minúsculas y sin espacios.

# usergroup.description
source: Select a user group for the username.
es: Selecciona un grupo de usuarios para el usuario

# usergroup.details
source: When a user logs in he is able to view all content which is access restricted to the user <em>group(s)</em> the user is a member of. Therefore the user login primarily makes sense with regard to the member groups.
es: Cuando un usuario inicia sesión, puede ver todo el contenido al que tiene acceso restringido el <em>grupo(s)</em> de usuarios al que pertenece. Por lo tanto, el inicio de sesión de usuario tiene sentido principalmente con respecto a los grupos de miembros.

# lockToDomain.description
source: Enter the host name from which the user is forced to login. NOTICE: this is not a security feature and can be circumvented by faking HTTP_HOST.
es: Introduzca el nombre de host desde el que el usuario está obligado a iniciar sesión. AVISO: esta no es una característica de seguridad y puede ser eludida falsificando HTTP_HOST.

# lockToDomain.details
source: A TYPO3 system may have multiple domains pointing to it. Therefore this option secures that users can login only from a certain host name.
es: Un sistema TYPO3 puede tener múltiples dominios apuntando a él. Por lo tanto, esta opción asegura que los usuarios sólo puedan iniciar sesión desde un determinado nombre de host.

# lockToDomain.syntax
source: Either a domain name, "www.typo3.org" or an IP address, "10.34.222.83"
es: Un nombre de dominio, "www.typo3.org" o una dirección IP, "10.34.222.83".

# name.description
source: Enter the regular name of the user, both first- and surname.
es: Introduzca el nombre y apellidos del usuario.

# address.description
source: Enter the street address of the user.
es: Introduzca la dirección del usuario.

# www.description
source: Enter the homepage URL
es: Introduzca la URL de la página principal

# title.description
source: Enter the job title, eg. 'Director' or 'Accountant'.
es: Ingrese el título del puesto, por ejemplo: 'Director' o 'Contador'.

# company.description
source: Enter the name of the company in which the user is employed.
es: Introduzca el nombre de la empresa en la que trabaja el usuario.

# image.description
source: Insert a photo of the user.
es: Insertar una foto del usuario.

# starttime.description
source: Enter the date from which the account is active.
es: Introduzca la fecha a partir de la cual la cuenta está activa.

# starttime.syntax
source: The syntax is dd-mm-yy, but you can just enter a "d" in the field to insert todays date. Or "d+10" to insert the date 10 days from now etc. The field will re-format any input to fit the format it understands so you can just experiment and you will be able to clearly see how dates should be entered.
es: La sintaxis es dd-mm-yy, pero puede introducir una "d" en el campo para insertar la fecha de hoy. O "d+10" para insertar la fecha dentro de 10 días, etc. El campo reformateará cualquier entrada para que se ajuste al formato que entiende, de modo que sólo pueda experimentar y pueda ver claramente cómo se deben introducir las fechas.

# endtime.description
source: Enter the date from which the account is disabled.
es: Introduzca la fecha a partir de la cual se desactiva la cuenta.

# endtime.syntax
source: See "Start"
es: Ver "Inicio"

# lastlogin.description
source: This field shows the user's last log in date.
es: Este campo muestra la última fecha de inicio de sesión del usuario.

# TSconfig.description
source: Enter additional TSconfig for the user (advanced).
es: Introduzca TSconfig adicional para el usuario (avanzado).

# TSconfig.details
source: This field allows you to enter TypoScript style configuration values for the user. Currently there are no system defined keys. If there ever will be, they will be described in detail in the administrative documentation. The primary use of this field (as well as the 'sister'-field in the Website usergroup table) is for custom purposes. In this case, you should use the root-key "user" for your customly defined values. Thus you don't risk any future system keys to interfere with your configuration. You access the values of the configuration from your frontend plugins by calling the function <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> which will return an array with the valuetree in it. <b>Warning:</b> You should use Website user/group TSconfig in your PHP-scripts ONLY if your resulting content is NOT being cached! So call it from TypoScript USER_INT cObjects or disable caching from your PHP-code by calling <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig from Website usergroups:</b> Notice that the configuration from the field TSconfig in the member groups of the user is accumulated and prepended to the TSconfig of the user before it's parsed. This means for instance that a key defined in the TSconfig of the user (this field) will override the same key defined in the last (bottom) usergroup in the list which will again override the same key defined in the first (top) usergroup in the list. <b>Example:</b> Let's imagine you want to define for a user that his name is printed in the bottom of the webpages when he is logged in. First of all you must write a PHP-function and insert the result from it as a USER_INT cObject in the bottom of the page. But your function needs to know, whether or not this user is configured to have his name printed. So you decide to use a custom TSconfig key, 'user.printUserName': <em>In the TSconfig field of the user or usergroup:</em> user.printUserName = 1 <em>In your PHP-function:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }
es: Este campo permite introducir valores de configuración de estilo TypoScript para el usuario. Actualmente no hay claves definidas por el sistema. Si alguna vez los hay, se describirán en detalle en la documentación administrativa. El uso principal de este campo (así como el campo "hermano" en la tabla del grupo de usuarios del sitio web) es para propósitos personalizados. En este caso, debe utilizar la clave raíz "user" para sus valores definidos de forma personalizada. Por lo tanto, no se arriesga a que futuras claves del sistema interfieran con su configuración. Puede acceder a los valores de la configuración desde sus plugins de frontend llamando a la función <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> que devolverá una matriz con el árbol de valores en ella. <b>Advertencia:</b> Usted debe usar TSconfig de usuario/grupo del sitio web en sus scripts PHP SÓLO si su contenido resultante NO está siendo almacenado en caché! Así que llámalo desde TypoScript USER_INT cObjects o desactiva el caché desde tu código PHP llamando a <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig desde Grupos de usuarios del sitio web:</b> Observe que la configuración del campo TSconfig en los grupos de miembros del usuario se acumula y se envía previamente a la TSconfig del usuario antes de ser analizada. Esto significa, por ejemplo, que una clave definida en la TSconfig del usuario (este campo) anulará la misma clave definida en el último grupo de usuarios (inferior) de la lista, lo que a su vez anulará la misma clave definida en el primer grupo de usuarios (superior) de la lista. <b>Ejemplo:</b> Imaginemos que quieres definir para un usuario que su nombre aparezca impreso en la parte inferior de las páginas web cuando esté conectado. En primer lugar debe escribir una función PHP e insertar el resultado como un USER_INT cObject en la parte inferior de la página. Pero su función necesita saber, si este usuario está o no configurado para imprimir su nombre. Así que usted decide usar una clave TSconfig personalizada,'user.printUserName': <em>En el campo TSconfig del usuario o grupo de usuarios:</em> user. printUserName = 1 <em>En su función PHP:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
es: Sintaxis TypoScript, sin condiciones y constantes.

# _TSconfig.seeAlso
source: TSconfig for TSFE | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TCEmain/ pages:TSconfig, fe_groups:TSconfig, be_users:TSconfig, be_groups:TSconfig
es: TSconfig para TSFE | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TCEmain/ pages:TSconfig, fe_groups:TSconfig, be_users:TSconfig, be_groups:TSconfig

# .description
source: A website login user.
es: Un acceso de usuario al sitio web.

# .details
source: These are users with a username and password who are allowed specific access to otherwise restricted areas on your website.
es: Se trata de usuarios con un nombre de usuario y contraseña a los que se les permite el acceso específico a las áreas restringidas de su sitio web.

# .image_descr
source: Part of the form for editing a frontend user. A typical login box (standard) on the website where frontend users can login.
es: Parte del formulario para editar un usuario de frontend. Una típica caja de inicio de sesión (estándar) en el sitio web donde los usuarios de frontend pueden iniciar sesión.
