Repository: JonEG/HighSchool
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_systmpl.xlf
Languages: es

# .description
source: TypoScript template record.
es: Registro de plantilla de TypoScript.

# .details
source: The 'Template' records are the vital components used to set the design of the webpages. No matter how (almost) you would like to build your website, it must be initiated by a 'Template' record placed in the root of the page tree of the site. Basically, create a 'Template' record, enter a title and make sure to check of Clear constants, setup and Rootline. Then enter some TypoScript configuration in the Setup field and you're set. It's very important to read how to do all this in the documents listed below! Also make sure you use the Web>Template module to do all the working with templates. It's a specialized tool to help you with this.
es: Los registros de 'Template' son los componentes vitales utilizados para establecer el diseño de las páginas web. No importa cómo (casi) le gustaría construir su sitio web, debe ser iniciado por un registro 'Template' colocado en la raíz del árbol de páginas del sitio. Básicamente, cree un registro de 'Template', introduzca un título y asegúrese de comprobar las constantes de Limpiar, la configuración y la línea raíz. A continuación, introduzca alguna configuración de TypoScript en el campo Setup y ya está. Es muy importante leer cómo hacer todo esto en los documentos que se enumeran a continuación! También asegúrese de usar el módulo Web>Template para hacer todo el trabajo con las plantillas. Es una herramienta especializada para ayudarle con esto.

# .image_descr
source: A Template Record with constants and setup code. The Web>Template module contains tools which will help you to edit and validate TypoScript structures.
es: Una plantilla de registro con constantes y código de configuración. El módulo Web>Template contiene herramientas que le ayudarán a editar y validar las estructuras TypoScript.

# hidden.details
source: If the Template Record was the first record on a page hiding it will expose the second record on the page instead.
es: Si el Registro de plantilla fue el primer registro en una página que ocultaba, expondrá el segundo registro en la página en su lugar.

# starttime.description
source: Start time. Use this to enable a template on a certain date.
es: Hora de inicio. Utilice esta opción para habilitar una plantilla en una fecha determinada.

# endtime.description
source: End time. Use this to disable a template on a certain date.
es: Hora final. Utilice esta opción para desactivar una plantilla en una fecha determinada.

# title.description
source: The title of the template record is only an internal label and does not have any effect on the output in the frontend.
es: El título de la plantilla de registro es sólo una etiqueta interna y no tiene ningún efecto en la salida en el frontend.

# sitetitle.description
source: Website title. Typically this will automatically be prefixed all page titles in the <title> tag of the frontend pages.
es: Título del sitio web. Típicamente esto será automáticamente prefijado a todos los títulos de página en la etiqueta <title> de las páginas frontend.

# constants.description
source: TypoScript Constants.
es: Constantes de TypoScript.

# config.description
source: TypoScript Setup code
es: Código de configuración de TypoScript

# config.details
source: Read more about TypoScript Templates in TSref, TypoScript by Example and Getting Started.
es: Lea más sobre Plantillas TypoScript en TSref, TypoScript por ejemplo y Getting Started.

# resources.description
source: Resource files for the template. For example a logo, a TTF-font etc.
es: Archivos de recursos para la plantilla. Por ejemplo, un logotipo, una fuente TTF, etc.

# resources.details
source: Resource files can be referenced in TypoScript Template code by [filename]*.[ext] and has the advantage that the reference from TypoScript is not broken if you copy or export a Template Record where the resources ends up with new names.
es: Los archivos de recursos se pueden referenciar en el código de plantilla de TypoScript mediante[nombre de archivo]*.[ext] y tiene la ventaja de que la referencia de TypoScript no se rompe si copia o exporta un registro de plantilla donde los recursos terminan con nuevos nombres.

# clear.description
source: Flags that will clear the inheritance of TypoScript code from former templates in the root line. There is a flag for Constants and one for Setup code.
es: Marcas que borrarán la herencia de código TypoScript de las plantillas anteriores en la línea raíz. Hay un indicador para constantes y otro para el código de configuración.

# clear.details
source: In the Web > Template / Template Analyzer module you can see how far back in the template tree that constants and setup code is inherited.
es: En el módulo Web > Template / Template Analyzer puede ver qué tan atrás en el árbol de plantillas se hereda la constante y el código de configuración.

# root.description
source: Defines that the template represents a root of a website.
es: Define que la plantilla representa una raíz de un sitio web.

# includeStaticAfterBasedOn.description
source: If set, static templates will be included after "based-on" templates. It basically swaps the order of inclusion of these external TypoScript sources.
es: Si está configurado, las plantillas estáticas se incluirán después de las plantillas "basadas en". Básicamente, cambia el orden de inclusión de estas fuentes TypoScript externas.

# includeStaticAfterBasedOn.details
source: The Web > Template / Template Analyzer module allows you to view the order of inclusion of all TypoScript sources your template uses.
es: El módulo Web > Template / Template Analyzer le permite ver el orden de inclusión de todas las fuentes de TypoScript que utiliza su plantilla.

# include_static.description
source: Static Template records to include.
es: Registros de plantillas estáticas para incluir.

# include_static_file.description
source: Static Template files to include.
es: Archivos de plantillas estáticas a incluir.

# include_static_file.details
source: Static template files are registered by extensions contrary to Static Template records which come from the static database table, "static_template".
es: Los archivos de plantilla estática se registran mediante extensiones contrarias a los registros de plantilla estática que provienen de la tabla de base de datos estática "static_template".

# basedOn.description
source: Other Template Records that are included like "static templates".
es: Otros registros de plantillas que se incluyen como "plantillas estáticas".

# static_file_mode.description
source: Define the mode of inclusion of static template files.
es: Definir el modo de inclusión de archivos de plantilla estática.

# static_file_mode.details
source: If you are in doubt about the inclusion order, make sure to use the Web > Template / Template Analyzer to view the order.
es: Si tiene dudas sobre el orden de inclusión, asegúrese de usar el módulo Web > Template / Template Analyzer para ver el orden.

# nextLevel.description
source: Defines a template record to make active one level out in the page tree of this branch. This can be used to define another template record for the general website while having a special template for the frontpage.
es: Define un registro de plantilla para activar un nivel en el árbol de páginas de esta rama. Esto se puede utilizar para definir otro registro de plantilla para el sitio web general, mientras que tiene una plantilla especial para la página principal.

# description.description
source: Enter a description of the template if you like.
es: Introduzca una descripción del modelo si lo desea.

# editorcfg.description
source: Editor Configuration for the stylesheet editor extension.
es: Configuración del editor para la extensión del editor de hojas de estilo.
