Repository: JonEG/HighSchool
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_fe_groups.xlf
Languages: es

# hidden.details
source: If you disable a user group all users which are members of the group will in effect not inherit any properties this group may have given them. For instance if a page or content element was assigned access only by this group and you disable the group, no one would gain access to that page or content element.
es: Si deshabilitas un grupo de usuarios, todos los usuarios que son miembros del grupo no heredarán ninguna propiedad que este grupo les haya dado. Por ejemplo, si a una página o elemento de contenido sólo se le asignó acceso por parte de este grupo y se deshabilita el grupo, nadie obtendría acceso a esa página o elemento de contenido.

# title.description
source: Name of the group.
es: Nombre de grupo.

# title.details
source: This title will appear as the group name in the 'Access'-list in other records.
es: Este título aparecerá como el nombre del grupo en la lista de ''Acceso'' en otros registros.

# lockToDomain.description
source: Enter the host name from which the group will be available only. NOTICE: this is not a security feature and can be circumvented by faking HTTP_HOST.
es: Introduzca el nombre de host desde el que el grupo estará disponible únicamente. AVISO: esta no es una característica de seguridad y puede ser eludida falsificando HTTP_HOST.

# lockToDomain.details
source: This options may be important if you have multiple websites in the same TYPO3 database but still only one main storage page for all Website users. Thus the users may log in on any of the website URLs. This may be considered a feature (having a global login as a user) or a problem (in which case you should have multiple user storages anyway). However you may wish to limit the use of a Website usergroup to a specific website and thus you don't want the group to be enabled for the user when he logs in at another URL (still from the same database of course). By entering the host name of the website here, you restrict the group to be used only from within this domain. <b>Notice:</b> The use for this option is not critical if you have multiple Website user storages, namely one for each site.
es: Esta opción puede ser importante si tiene varios sitios web en la misma base de datos de TYPO3 pero sólo una página de almacenamiento principal para todos los usuarios del sitio web. De este modo, los usuarios pueden acceder a cualquiera de las URL del sitio web. Esto puede ser considerado un beneficio (tener un inicio de sesión global como usuario) o un problema (en cuyo caso debería tener varios almacenamientos de usuarios de todos modos). Sin embargo, es posible que desee limitar el uso de un grupo de usuarios de un sitio web a un sitio web específico y, por lo tanto, no desea que el grupo esté habilitado para el usuario cuando éste inicie sesión en otra URL (por supuesto, desde la misma base de datos). Al introducir aquí el nombre de host del sitio web, se restringe el grupo que se va a utilizar sólo desde este dominio. <b>Aviso:</b> El uso de esta opción no es crítico si tiene varios almacenamientos de usuarios del sitio web, es decir, uno para cada sitio.

# subgroup.description
source: Member of other groups.
es: Miembro de otros grupos.

# subgroup.details
source: List of other groups that this group is a member of.
es: Lista de otros grupos a los que pertenece este grupo.

# description.description
source: Enter a description of the group.
es: Introduzca una descripción del grupo.

# description.details
source: This is for internal use and is just a way to put a note on what the group is for, why you created it and who should be members. Use it as you like.
es: Esto es para uso interno y es sólo una manera de poner una nota sobre para qué sirve el grupo, por qué lo creaste y quién debería ser miembro. Úsalo como quieras.

# TSconfig.description
source: TSconfig for the group (advanced).
es: TSconfig para el grupo (avanzado).

# TSconfig.details
source: This is the user TSconfig for the group. The values are inherited by any Website user who is a member of this group. The configuration is subject to being overridden in other groups and by the TSconfig of the user himself.
es: Este es el usuario TSconfig para el grupo. Los valores son heredados por cualquier usuario del sitio web que sea miembro de este grupo. La configuración está sujeta a ser anulada en otros grupos y por el TSconfig del propio usuario.

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
es: Sintaxis TypoScript, sin condiciones y constantes.

# .description
source: Usergroups for Website users.
es: Grupos de usuarios para los usuarios del sitio web.

# _.seeAlso
source: fe_users, About access restricting pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/PasswordProtectedPages/
es: fe_users, Acerca de la restricción de acceso a las páginas | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/PasswordProtectedPages/

# .image_descr
source: The form for editing frontend users groups. Pages, Content Elements and other records for frontend display often have a selector box where you can define access restriction by selecting access for a certain group only.
es: El formulario para editar grupos de usuarios de frontend. Las páginas, los Elementos de Contenido y otros registros para la visualización del frontend suelen tener un cuadro de selección en el que se puede definir la restricción de acceso seleccionando el acceso sólo para un grupo determinado.
