Repository: JonEG/HighSchool
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: es

# pages.details
source: This field is used by many of the Content Element types to create a relation to either a single target page or multiple target pages. If no target page is specified, the current page will generally be used. Using the "Search" Content Element, the target page is where search results will appear. You must make sure that this page has a similar "Search" Content Element to display the results. The "Login" Content Element (not to be confused with the Login plugin available when the felogin extension is installed) also uses this field to redirect the login to a certain page. That page does not need to contain a "Login" Content Element in order to perform the authentication since any TYPO3 page can handle a login request. If you specify a second page in this list, the ID will be passed to the login system as the page inside TYPO3 where website users are found. You should use this only if your template is not already configured to pass this value on. In order for the login procedure to work you must make sure that you have created website users and website usergroups, have specified where these website users can be found (typically a SysFolder), a page ID in the page list, and ensured that cookies are enabled for the site. The "Menu/Sitemap" Content Elements also use this field. In this case the page will determine the starting point for the menu or the actual pages shown in the menu. This behavior depends on the menu type you have selected. Finally the "Form" element uses this field as the target page to which the form is submitted. A common use is the "Thank you" page after the form is completed.
es: Este campo es utilizado por muchos de los tipos de elementos de contenido para crear una relación con una sola página de destino o con varias páginas de destino. Si no se especifica ninguna página de destino, generalmente se usará la página actual. Utilizando el elemento de contenido "Buscar", la página de destino es donde aparecerán los resultados de la búsqueda. Debe asegurarse de que esta página tiene un elemento de contenido de "Búsqueda" similar para mostrar los resultados. El Elemento de Contenido "Login" (que no debe confundirse con el plugin de Login disponible cuando la extensión felogin está instalada) también utiliza este campo para redirigir el login a una página determinada. Esa página no necesita contener un elemento de contenido de "Login" para realizar la autenticación, ya que cualquier página de TYPO3 puede gestionar una solicitud de inicio de sesión. Si especifica una segunda página en esta lista, el ID se pasará al sistema de inicio de sesión como la página dentro de TYPO3 donde se encuentran los usuarios del sitio web. Usted debe utilizar esto sólo si su plantilla no está ya configurada para pasar este valor.Para que el procedimiento de inicio de sesión funcione, debe asegurarse de que ha creado usuarios del sitio web y grupos de usuarios del sitio web, ha especificado dónde se pueden encontrar estos usuarios del sitio web (normalmente una SysFolder), un ID de página en la lista de páginas, y se ha asegurado de que las cookies están habilitadas para el sitio. Los elementos de contenido "Menú/Mapa del sitio" también utilizan este campo. En este caso, la página determinará el punto de partida para el menú o las páginas reales que se muestran en el menú. Este comportamiento depende del tipo de menú que haya seleccionado. Finalmente, el elemento "Form" utiliza este campo como página de destino a la que se envía el formulario. Un uso común es la página de " Thank you " después de completar el formulario.

# recursive.description
source: The number of subpage levels that should also be included for each page in the list.
es: El número de niveles de subpágina que también deben incluirse para cada página de la lista.

# recursive.details
source: This feature depends on the TypoScript template configuration and Content Element type. If enabled, each page listed in the "Pages" field will also have its subpages included to the specified depth. <strong>Warning:</strong> If there are many subpages, be aware that this option may return a large number of results
es: Esta función depende de la configuración de la plantilla TypoScript y del tipo de Elemento de Contenido. Si está habilitada, cada página listada en el campo "Páginas" también tendrá sus subpáginas incluidas a la profundidad especificada. <strong>Advertencia:</strong> Si hay muchas subpáginas, tenga en cuenta que esta opción puede devolver un gran número de resultados

# menu_type.description
source: Select the type of menu you wish to create.
es: Seleccione el tipo de menú que desea crear.

# menu_type.details
source: This is a short description of each type: <strong>Menu of selected pages</strong> This will create a menu with links to the pages in the Selected Pages list. <strong>Menu of subpages of selected pages</strong> This will create in a menu with links to the subpages of the pages in the Selected Pages list. If you do not specify any pages, the subpages to the current page will be used. <strong>Menu of subpages of selected pages (with abstract)</strong> Like the previous option, but also displays the content of the Abstract field (or the Description field) for each page in the menu. The Abstract field is given priority over the Description field if both are complete. <strong>Menu of subpages of selected pages + sections</strong> Like the previous option, but includes links to all Content Elements on the page that are marked to Show In Section Menus. <strong>Sitemap</strong> Generates a classic tree sitemap. Notice that the sitemap will begin from the current page unless you select another page instead. <strong>Section index (page content marked for section menus)</strong> This makes a menu of Content Elements on the selected pages for all Content Elements marked to Show In Section Menu. This is a great way to make an index at the top of the page. If you don't want certain Content Elements to appear in the list, just uncheck the Show in Section Menus checkbox for those elements. <strong>Recently updated pages</strong> This displays the 10 most recently updated pages. <strong>Notice:</strong> If you update a page and the updated page is not included in this list, clearing the Page Cache will resolve the issue. <strong>Related pages (based on keywords)</strong> Displays other related pages based on the keywords of the selected pages matched against the keywords of other pages.
es: Esta es una breve descripción de cada tipo: <strong>Menú de páginas seleccionadas </strong> Esto creará un menú con enlaces a las páginas de la lista de Páginas Seleccionadas. <strong>Menú de subpáginas de páginas seleccionadas </strong> Esto creará un menú con enlaces a las subpáginas de las páginas de la lista de Páginas seleccionadas. Si no especifica ninguna página, se utilizarán las subpáginas de la página actual. <strong>Menú de subpáginas de las páginas seleccionadas (con resumen)</strong> Como la opción anterior, pero también muestra el contenido del campo Resumen (o el campo Descripción) para cada página del menú. El campo Resumen tiene prioridad sobre el campo Descripción si ambos están completos. <strong>Menú de subpáginas de páginas seleccionadas + secciones</strong> Como la opción anterior, pero incluye enlaces a todos los Elementos de Contenido de la página que están marcados para Mostrar en los Menús de Sección. <strong>Mapa del sitio </strong> Genera un mapa del sitio clásico del árbol. Tenga en cuenta que el mapa del sitio comenzará desde la página actual a menos que seleccione otra página en su lugar. <strong>Indice de sección (el contenido de la página está marcado para los menús de la sección)</strong> Esto hace un menú de Elementos de Contenido en las páginas seleccionadas para todos los Elementos de Contenido marcados para Mostrar en el Menú de Sección. Esta es una gran manera de hacer un índice en la parte superior de la página. Si no desea que ciertos Elementos de Contenido aparezcan en la lista, simplemente desactive la casilla de verificación Mostrar en los Menús de la Sección para esos elementos. <strong>Páginas actualizadas recientemente </strong> Esto muestra las 10 páginas actualizadas más recientemente. <strong>Nota:</strong>Si actualiza una página y la página actualizada no está incluida en esta lista, al vaciar la caché de páginas se solucionará el problema. <strong>Páginas relacionadas (basadas en palabras clave)</strong> Muestra otras páginas relacionadas basadas en las palabras clave de las páginas seleccionadas que coinciden con las palabras clave de otras páginas.

# list_type.description
source: Select a plugin to insert.
es: Seleccione un plugin para insertar.

# list_type.details
source: The list of plugins you can insert on a page. The available plugins depend on which extensions are installed.
es: La lista de plugins que puede insertar en una página. Los plugins disponibles dependen de las extensiones instaladas.

# media.description
source: Files can be added to the list here.
es: Los archivos se pueden añadir a la lista aquí.

# multimedia.description
source: Insert a multimedia element here (ex. Flash movie)
es: Insertar un elemento multimedia aquí (por ejemplo, Flash movie)

# filelink_size.description
source: Enable the display of file sizes.
es: Habilitar la visualización de los tamaños de archivo.

# records.description
source: Insert records to be displayed on this page.
es: Insertar registros para que se muestren en esta página.

# sectionIndex.description
source: If set, the Content Element will appear in Section Menus.
es: Si está configurado, el Elemento de Contenido aparecerá en los Menús de Sección.

# sectionIndex.details
source: See more details about Section Menus by clicking below.
es: Vea más detalles sobre los menús de la sección haciendo clic a continuación.

# linkToTop.description
source: If checked, a small "To Top" link will be added after the Content Element, linking back to the top of the page.
es: Si esta opción está seleccionada, se añadirá un pequeño enlace "To Top" después del Elemento de contenido, que enlazará de nuevo con la parte superior de la página.

# rte_enabled.description
source: If checked, the Rich Text Editor will be disabled for the "Text" and "Text & Image" types (<em>in this Content Element only</em>).
es: Si esta opción está seleccionada, el Editor de texto enriquecido estará desactivado para los tipos "Texto" y "Texto e imagen" (<em>en este Elemento de contenido sólo </em>).

# pi_flexform.description
source: Plugin Configuration
es: Configuración de plugins

# pi_flexform.details
source: Some plugins may provide configuration options, but the actual options vary based on the plugin. Behind the scenes, these are based on FlexForms and stored as XML.
es: Algunos plugins pueden proporcionar opciones de configuración, pero las opciones reales varían en función del plugin. Entre bastidores, estos se basan en FlexForms y se almacenan como XML.
