Repository: JonEG/HighSchool
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_weblayout.xlf
Languages: es

# .alttitle
source: Web > Page Module
es: Web > Página

# .description
source: The page module is activated from the backend menu and is the primary module for all basic CMS operations you need to perform when maintaining website content.
es: El módulo de página se activa desde el backend y es el módulo principal para todas las operaciones básicas necesarias para mantener el contenido del sitio web.

# .details
source: Selecting the module will display the page tree. Click the title of the page you wish to edit content on, and in the right frame you will see the content of the page displayed by the Page module. The page module has various modes of display of content; <b>Columns</b> The columns view will show Content Elements listed in the columns and in the order that they will appear on the website. A panel of buttons will allow you to hide/unhide, move and edit the elements easily. <b>QuickEdit</b> In QuickEdit the first element on the page will be loaded into a form right away. It will depend on the implementation of your website as well as your general preferences if you like this mode more than the columns view. <b>Languages</b> If your site supports multiple languages and uses the "one-tree-fits-all" concept for localization you will need this mode to control the translations of the content elements on a page. <b>Page information</b> The page information view shows some statistical data about a page. This includes hit statistics if available. <b>General options</b> In the top of the Page module you will find a row of icons that will bring you right to various features such as History/Undo (1), Create new content element (2), Move page (3), Create new page (4) and Edit page properties (5). See image below. <b>Defining number of displayed columns [Admin]</b> Administrators can configure the Page module to display only the content columns that the website uses. This is done by Page TSconfig (so it can be configured per branch in the page tree!) and this particular option has the object path "mod.web_layout.tt_content.colPos_list". For instance "mod.web_layout.tt_content.colPos_list = 0,3" will set the display of the "Normal" and "Border" columns only. There are many other options for customization of the Page module in the object path "mod.web_layout" and Administrators should refer to the "TSconfig" reference linked to below.
es: Al seleccionar el módulo se mostrará el árbol de páginas. Haga clic en el título de la página en la que desea editar el contenido, y en el marco derecho verá el contenido de la página que muestra el módulo Página. El módulo de página tiene varios modos de visualización de contenido; <b>Columnas</b> La vista de columnas mostrará los Elementos de Contenido listados en las columnas y en el orden en que aparecerán en el sitio web. Un panel de botones le permitirá ocultar/desocultar, mover y editar los elementos fácilmente. <b>Edición rápida</b> En ""Edición rápida" el primer elemento de la página se cargará en un formulario inmediatamente. Dependerá de la implementación de su sitio web así como de sus preferencias generales si le gusta este modo más que la vista de columnas. <b>Idiomas</b> Si su sitio admite varios idiomas y utiliza el concepto de "un árbol para todos" para la localización, necesitará este modo para controlar las traducciones de los elementos de contenido de una página. <b>Información de la página</b> La vista de información de página muestra algunos datos estadísticos sobre una página. Esto incluye estadísticas de visitas si están disponibles. <b>Opciones generales</b> En la parte superior del módulo Página encontrará una fila de iconos que le llevarán directamente a varias funciones como Historial/Deshacer (1), Crear nuevo elemento de contenido (2), Mover página (3), Crear nueva página (4) y Editar propiedades de página (5). Vea la imagen de abajo. <b>Definición del número de columnas mostradas[Administración]</b> Los administradores pueden configurar el módulo Página para que muestre sólo las columnas de contenido que utiliza el sitio web. Esto se hace mediante Page TSconfig (por lo que se puede configurar por rama en el árbol de páginas) y esta opción en particular tiene la ruta de objeto "mod.web_layout.tt_content.colPos_list". Por ejemplo "mod.web_layout.tt_content.colPos_list = 0,3" ajustará la visualización de las columnas "Normal" y "Border" solamente. Existen muchas otras opciones para la personalización del módulo Página en la ruta de objetos "mod.web_layout" y los administradores deben referirse a la referencia "TSconfig" a la que se enlaza a continuación.Traducción realizada con el traductor www.DeepL.com/Translator

# _.seeAlso
source: Configuring the Page module [Technical] | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, About the page module | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Editing a page | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ The Page Module (Animation) | Using the page tree (Animation) | FILE:EXT:welcome/modsub/ani_05.gif
es: Configurando el módulo de página[Técnico] | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:nuevas_páginas, xMOD_csh_corebe:TCEforms, Acerca del módulo de página | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Editando una página | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ El módulo de página (Animación) | Uso del árbol de páginas (Animación) | FILE:EXT:welcome/modsub/ani_05.gif

# .image_descr
source: Click the Page module, then the title of a page in the page tree. The page module is now activated in the right frame, showing the content of the page you clicked in the page tree. These buttons are direct links to the History/Undo function (1), Create new content element wizard (2), Move page wizard (3), Create new page wizard (4) and Edit page properties form (5). See the links for more details.
es: Haga clic en el módulo Página y luego en el título de una página en el árbol de páginas. El módulo de página está ahora activado en el marco derecho, mostrando el contenido de la página en la que ha hecho clic en el árbol de páginas. Estos botones son enlaces directos a la función Historial/Deshacer (1), Asistente para crear nuevos elementos de contenido (2), Asistente para mover páginas (3), Asistente para crear nuevas páginas (4) y Formulario de propiedades de página (5). Vea los enlaces para más detalles.

# quickEdit.alttitle
source: Quick Edit
es: Edición rápida

# quickEdit.description
source: The Quick Editor gives you direct access to the form fields of the page content.
es: El Editor rápido le da acceso directo a los campos del formulario del contenido de la página.

# quickEdit.details
source: The Quick Editor is designed to cut down the number of clicks involved in getting to edit the page content. Simply by clicking the page title in the page tree you've got the first content element in the normal column loaded in the list frame. In the toolbar in the top you can select the other content elements on the page in the selector box.
es: El Editor Rápido está diseñado para reducir el número de clics necesarios para editar el contenido de la página. Simplemente haciendo clic en el título de la página en el árbol de páginas, tendrá el primer elemento de contenido en la columna normal cargado en el marco de la lista. En la barra de herramientas de la parte superior puede seleccionar los demás elementos de contenido de la página en el cuadro de selección.

# quickEdit.image_descr
source: The QuickEdit view cuts of one extra click by bringing the user directly to the editing form after clicking a page title in the page tree. The record shown is always the first content element from the Normal column.
es: La vista de Edición Rápida lleva al usuario directamente al formulario de edición después de hacer clic en el título de una página en el árbol de páginas. El registro que se muestra es siempre el primer elemento de contenido de la columna Normal.

# quickEdit_selElement.alttitle
source: Content Elements
es: Elementos de contenido

# quickEdit_selElement.description
source: This is an overview of the content elements on this page in QuickEdit mode. Select another element to edit or click a "New" icon to create a new content element.
es: Esta es una descripción general de los elementos de contenido de esta página en el modo Edición Rápida. Seleccione otro elemento para editar o haga clic en el icono "Nuevo" para crear un nuevo elemento de contenido.

# quickEdit_selElement.image_descr
source: Overview of page content elements in the QuickEdit view. In the bottom there are links to two wizards: The "Move Content Element Wizard" and the "Create new Content Element Wizard". See the links below.
es: Vista general de los elementos de contenido de la página en la vista Edición Rápida. En la parte inferior hay enlaces a dos asistentes: El "Asistente para mover elementos de contenido" y el "Asistente para crear nuevos elementos de contenido". Vea los enlaces a continuación.

# columns_1.image_descr
source: When your website supports multiple content element zones in the template you will be able to use another column than the "Normal" column. Here the "Left" column is enabled. TYPO3 offers four columns by default, "Normal", "Right", "Left" and "Border". Their significance depends on individual implementations in the frontend templates.
es: Cuando su sitio web admita varias zonas de elementos de contenido en la plantilla, podrá utilizar una columna distinta a la columna "Normal". Aquí se habilita la columna "Izquierda". TYPO3 ofrece por defecto cuatro columnas: "Normal", "Derecha", "Izquierda" y "Borde". Su importancia depende de las implementaciones individuales en las plantillas de frontend.

# columns_2.alttitle
source: Listing by Language
es: Listado por idioma

# columns_2.image_descr
source: In the Language view you can select to create a new translation of the page if one does not exist already. The available languages must be defined first by language records created in the root of the page tree. This example shows how page content for three languages is shown side-by-side in the Page module. In the top of the Page module you can also select between the available translations... ... and if you select any of the additional languages (here "Danish" and "German") you will see the default language displayed side-by-side with the selected language
es: En la vista Idioma puede seleccionar crear una nueva traducción de la página si no existe ya. Los idiomas disponibles deben ser definidos primero por los registros de idioma creados en la raíz del árbol de páginas. Este ejemplo muestra cómo el contenido de la página en tres idiomas se muestra lado a lado en el módulo Página. En la parte superior del módulo Página también puede seleccionar una de las traducciones disponibles... ... y si selecciona cualquiera de los idiomas adicionales (aquí "danés" y "alemán"), verá el idioma por defecto junto con el idioma seleccionado.

# columns_3.alttitle
source: Page Information
es: Información de la página

# columns_3.description
source: In the "Page Information" view you can see various statistics about a page.
es: En la vista "Información de página" puede ver varias estadísticas sobre una página.

# columns_3.details
source: The page information reveals information such as the date of creation and last modification of the page and its content. You can also see the subtitle, keywords and descriptions. This information is often used on websites for meta data or searching.
es: La información de la página revela información como la fecha de creación y la última modificación de la página y su contenido. También puede ver el subtítulo, las palabras clave y las descripciones. Esta información se utiliza a menudo en sitios web para metadatos o búsquedas.

# columns_single.alttitle
source: Page content elements in a single column
es: Elementos de contenido de la página en una sola columna

# columns_single.description
source: The single column view will show the page content elements that define the content on this page of your website. Click an edit icon or element text to edit an element.
es: La vista de una sola columna mostrará los elementos de contenido de la página que definen el contenido de esta página de su sitio web. Haga clic en un icono de edición o en un elemento de texto para editar un elemento.

# columns_single.details
source: You can also hide, delete and move elements by using the control panels. Clicking the "New content element" icon you will be able to create new content elements in between the existing elements on the page. Click the icon of a content element if you wish to access the context menu of the element.
es: También puede ocultar, borrar y mover elementos utilizando los paneles de control. Haciendo clic en el icono "Nuevo elemento de contenido" podrás crear nuevos elementos de contenido entre los elementos existentes en la página. Haga clic en el icono de un elemento de contenido si desea acceder al menú contextual del elemento.

# columns_single.image_descr
source: Content Elements on a page are arranged in a specific order - the order they appear on the website. This order is also shown in the page module. The control panel allows you to move elements up and down as well as edit, hide and delete them. You can also just click the preview text shown here to access the editing form of the element.
es: Los Elementos de Contenido en una página están dispuestos en un orden específico - el orden en que aparecen en el sitio web. Este orden también se muestra en el módulo de página. El panel de control le permite mover elementos hacia arriba y hacia abajo, así como editarlos, ocultarlos y eliminarlos. También puede hacer clic en el texto de vista previa que se muestra aquí para acceder al formulario de edición del elemento.

# button_panel.alttitle
source: The "Big Buttons"
es: Los "Grandes Botones"

# button_panel.description
source: These buttons will bring you to four most used functions in relation to building pages. From here you can edit the page properties (eg. the page title), you can move the current page to another position in the page tree, create a new page somewhere in the page tree or create new content elements on this page.
es: Estos botones le llevarán a las cuatro funciones más utilizadas en relación con la creación de páginas. Desde aquí puede editar las propiedades de la página (por ejemplo, el título de la página), puede mover la página actual a otra posición en el árbol de páginas, crear una nueva página en algún lugar del árbol de páginas o crear nuevos elementos de contenido en esta página.
