Repository: JonEG/HighSchool
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: es

# .description
source: All visible content on webpages is typically made by "Page Content" records, often referred to as "Content Elements". Content Elements are managed by the "Page" Module which organizes Content Elements in multiple columns and languages.
es: Todo el contenido visible de las páginas web se realiza normalmente mediante registros de "Contenido de la página", a los que a menudo se hace referencia como "Elementos de contenido". Los Elementos de Contenido son administrados por el Módulo "Página" que organiza los Elementos de Contenido en múltiples columnas e idiomas.

# .details
source: "Page Content" records are sortable and can be rearranged. The "Language" and "Column" selectors of the "Page Content" records determines when and where they appear. If you do not change the value of the "Language" and "Column" selectors the Content Element will appear in the default configuration.
es: Los registros de "Contenido de la página" se pueden ordenar y reorganizar. Los selectores "Idioma" y "Columna" de los registros " Página de contenido " determinan cuándo y dónde aparecen. Si no cambia el valor de los selectores " Idioma " y " Columna ", el Elemento de Contenido aparecerá en la configuración por defecto.

# _.seeAlso
source: Page Content Principles | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout
es: Principios de contenido de la página | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout

# .image_descr
source: The Page Module is used to manage Content Elements arranged in columns and languages. A Content Element has an editing form with many options. The "Type" determines which options are visible. In the Frontend, a Content Element like the above could look like this.
es: El Módulo de Páginas se utiliza para gestionar Elementos de Contenido dispuestos en columnas e idiomas. Un Elemento de Contenido tiene un formulario de edición con muchas opciones. El "Tipo" determina qué opciones son visibles. En el Frontend, un Elemento de Contenido como el anterior podría verse así.

# CType.description
source: Select the kind of Page Content this element represents. New options will appear when you save the record.
es: Seleccione el tipo de contenido de la página que representa este elemento. Aparecerán nuevas opciones cuando guarde el registro.

# _CType.seeAlso
source: tt_content:colPos, tt_content:sys_language_uid, About Content Elements | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/
es: tt_content:colPos, tt_content:sys_language_uid, Acerca de Elementos de Contenido | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/

# starttime.description
source: Enter the date when the Content Element should be published and displayed on the website.
es: Introduzca la fecha en la que el Elemento de Contenido debe publicarse y mostrarse en el sitio web.

# endtime.description
source: Enter the date when the Content Element should expire and disappear from the website.
es: Introduzca la fecha en la que el Elemento de Contenido debe expirar y desaparecer del sitio web.

# fe_group.description
source: If Usergroup Access Rights are set to a usergroup name, only website users who are logged in and members of the selected usergroup will be able to view the Content Element. The special option 'Hide at Login' means the Content Element will <em>not</em> be visible for any website users that are logged in. Likewise "Show at Any Login" will make the Content Element visible for any logged in website user.
es: Si los Derechos de Acceso de Grupos de Usuarios están configurados con un nombre de grupo de usuarios, sólo los usuarios del sitio web que hayan iniciado sesión y los miembros del grupo de usuarios seleccionado podrán ver el Elemento de Contenido. La opción especial 'Ocultar en el inicio de sesión' significa que el elemento de contenido será <em>no</em> visible para cualquier usuario del sitio web que haya iniciado sesión. Del mismo modo, "Mostrar en cualquier inicio de sesión" hará que el Elemento de Contenido sea visible para cualquier usuario del sitio web que haya iniciado sesión.

# fe_group.details
source: The 'Hide at Login' option is is useful if you want to present information like "How to Login" that becomes irrelevant when a website user is actually logged in.
es: La opción 'Ocultar al iniciar sesión' es útil si desea presentar información como "Cómo iniciar sesión" que se vuelve irrelevante cuando un usuario del sitio web está realmente conectado.

# sys_language_uid.description
source: Select the system language of this Content Element. <strong>Notice:</strong> This will affect the Content Element visibility by limiting it to a certain language.
es: Seleccione el idioma del sistema de este Elemento de Contenido. <strong>Nota:</strong> Esto afectará a la visibilidad de los Elementos de Contenido al limitarla a un idioma determinado.

# sys_language_uid.details
source: This allows you to assign a specific language to the Content Element. If you select anything but the default value, the element will <em>not</em> be visible unless the language assigned is also configured by the TypoScript template. The available system languages are created by the administrator.
es: Esto le permite asignar un idioma específico al Elemento de Contenido. Si selecciona algo que no sea el valor por defecto, el elemento <em>no</em> será visible a menos que el lenguaje asignado también esté configurado por la plantilla TypoScript. Los idiomas disponibles del sistema son creados por el administrador.

# _sys_language_uid.seeAlso
source: tt_content:colPos, sys_language, Localization concepts [Technical] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list
es: tt_content:colPos, sys_language, Conceptos de localización [Técnico] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list

# layout.description
source: Select a Layout.
es: Seleccione un Layout

# layout.details
source: This option does not work by default for all Content Elements but your website may display Content Elements differently depending on the layout. The File Links Content Element does make use of the Layout field by default: "Normal" will provide a list of file links with no thumbnail. "Layout 1" adds a file icon to the left of the link "Layout 2" adds a thumbnail for image files and an icon for other files. A black border is wrapped around the icon. "Layout 3" is similar to Layout 2, but without the black border.
es: Esta opción no funciona de forma predeterminada para todos los Elementos de Contenido, pero es posible que su sitio web muestre los Elementos de Contenido de forma diferente según el diseño. El Elemento de Contenido de Enlaces de Archivos hace uso del campo Layout por defecto: "Normal" proporcionará una lista de enlaces de archivos sin miniaturas. El "Layout 1" añade un icono de archivo a la izquierda del enlace El "Layout 2" añade una miniatura para los archivos de imagen y un icono para otros archivos. Un borde negro se envuelve alrededor del icono. El "Layout 3" es similar al Layout 2, pero sin el borde negro.

# colPos.description
source: Select the column position of this element. <strong>Notice:</strong> This may affect whether the Content Element is visible depending on your website template.
es: Seleccione la posición de la columna de este elemento. <strong>Nota:</strong> Esto puede afectar si el Elemento de Contenido es visible dependiendo de la plantilla de su sitio web.

# colPos.details
source: Many websites only use one column of content. Some templates, however, let you put content in multiple columns using the Column option. <strong>Notice:</strong> Selecting a column other than "Normal" may cause the Content Element to disappear if the website template does not use that column. If your Content Element mysteriously disappears make sure the Column and Language selectors are set correctly.
es: Muchos sitios web sólo utilizan una columna de contenido. Algunas plantillas, sin embargo, le permiten poner contenido en múltiples columnas usando la opción Columna. <strong>Nota:</strong> La selección de una columna distinta a "Normal" puede hacer que el Elemento de Contenido desaparezca si la plantilla del sitio web no utiliza esa columna. Si su Elemento de Contenido desaparece misteriosamente, asegúrese de que los selectores de Columna e Idioma estén configurados correctamente.

# date.description
source: Enter a date to be displayed above the header.
es: Introduzca una fecha que se visualizará encima de la cabecera.

# header.description
source: Enter header text for the Content Element.
es: Introduzca el texto de cabecera para el Elemento de Contenido.

# header.details
source: Almost all Content Elements will display this header above the content. If you don't want the header displayed, set the header Layout to "Hidden". You can also choose not to enter any content in this field. Some content element types do not display the header by default. In those cases the Header field is typically labeled "Name" instead. One example is the HTML Content Element.
es: Casi todos los Elementos de Contenido mostrarán este encabezado encima del contenido. Si no desea que se muestre el encabezado, defina el Layout del encabezado como "Oculto". También puedes elegir no introducir ningún contenido en este campo. Algunos tipos de elementos de contenido no muestran la cabecera por defecto. En estos casos, el campo Header suele llevar la etiqueta "Name" en su lugar. Un ejemplo es el Elemento de Contenido HTML.

# header_position.description
source: Aligns the header to the left, center, or right.
es: Alinea el encabezado a la izquierda, al centro o a la derecha.

# header_link.description
source: Creates a link from the header to a Page ID, email address, or URL.
es: Crea un enlace desde el encabezado a un ID de página, dirección de correo electrónico o URL.

# header_link.syntax
source: If you insert a Page ID (ex. 51), the link will point to the page with id=51 <em>inside</em> TYPO3. If you insert an email address (ex. name@my-domain.test), the link will point to that email address. If you insert an URL or domain, (ex. www.typo3.org or http://www.my-domain.org), the link will point to that website.
es: Si inserta un ID de página (ej. 51), el enlace apuntará a la página con id=51 <em>dentro</em> TYPO3. Si inserta una dirección de correo electrónico (por ejemplo, name@my-domain.test), el enlace apuntará a esa dirección de correo electrónico. Si inserta una URL o un dominio (por ejemplo, www.typo3.org o http://www.my-domain.org), el enlace apuntará a ese sitio web.

# header_layout.description
source: Select a visual design for the header.
es: Seleccione un diseño visual para el encabezado.

# header_layout.details
source: If you select "Default" the standard design (which is one of the layouts 1-5) will be used. Alternatively you can select from Layout 1 through 5 which are configured in the website template with individual visual designs. If you select "Hidden" the header will simply not appear. This is useful when you don't need a header to display on the website but still want to identify the Content Element in the Backend.
es: Si selecciona "Predeterminado", se utilizará el diseño estándar (que es uno de los layouts 1-5). Alternativamente, puede seleccionar desde el Layout 1 al 5 que se configuran en la plantilla del sitio web con diseños visuales individuales. Si selecciona "Oculto", el encabezado simplemente no aparecerá. Esto es útil cuando no se necesita un encabezado para mostrar en el sitio web, pero aún así se desea identificar el Elemento de contenido en el Backend.

# subheader.description
source: Enter a subheader to be displayed below the main header. If the Content Element is a "Form" this field is instead used as the Recipient Email.
es: Introduzca una subcabecera que se visualizará debajo de la cabecera principal. Si el Elemento de Contenido es un "Formulario", este campo se utiliza en su lugar como el Email del Destinatario.

# subheader.details
source: A subheader is displayed only with "Header" Content Elements and with "Form" Content Elements (as the Recipient Email).
es: Un subtítulo se muestra sólo con Elementos de contenido "Header" y con Elementos de contenido "Form" (como el Email del destinatario).

# bodytext.description
source: Enter the main text.
es: Introduzca el texto principal.

# bodytext.details
source: The main text of the Content Element is entered here and can be formatted with HTML or a Rich Text Editor. The field is reused in other Content Element types so changing the type will cause any text to be reused in that new Content Element type. When you're using this field with the "Text" and "Text & Images" types, the content is normal body text. Each linebreak signifies a new paragraph, you can use the special TYPO3 tag, &lt;LINK&gt;, for making links. You can use many HTML tags but there are limitations depending on your website configuration. A Rich Text Editor is commonly used to add a visual editing interface for 'Text' and 'Text & Images' Content Elements. <b>Bullet Lists:</b> If the type is "Bullet List" each line in this field is a bullet item. <b>Tables:</b> If the type is "Table" each line represents a table row. Within each line, columns are divided by a vertical bar ('|'). A table row with 3 columns could look like "This is column 1 | Column 2 here | Third column!". The table wizard can also be used for creating tables and is much easier than hand coding them.
es: El texto principal del Elemento de Contenido se introduce aquí y puede ser formateado con HTML o con un Editor de Texto Enriquecido. El campo se reutiliza en otros tipos de Elementos de Contenido, por lo que cambiar el tipo causará que cualquier texto sea reutilizado en ese nuevo tipo de Elementos de Contenido. Cuando se utiliza este campo con los tipos "Texto" y "Texto e imágenes", el contenido es texto normal del cuerpo. Cada linebreak significa un nuevo párrafo, puedes usar la etiqueta especial TYPO3, &lt;LINK&gt;, para hacer enlaces. Usted puede utilizar muchas etiquetas HTML, pero hay limitaciones dependiendo de la configuración de su sitio web. Un Editor de Texto Enriquecido es comúnmente usado para agregar una interfaz de edición visual para `Texto' y `Texto & Imágenes' Elementos de Contenido. <b>Listas de viñetas:</b> Si el tipo es "Lista de viñetas" cada línea en este campo es un ítem de viñeta. <b>Tablas:</b> Si el tipo es "Tabla", cada línea representa una fila de tabla. Dentro de cada línea, las columnas se dividen por una barra vertical ('|'). Una fila de tabla con 3 columnas podría verse como "Esta es la columna 1 | Columna 2 aquí | Tercera columna!" El asistente de tablas también se puede utilizar para crear tablas y es mucho más fácil que codificarlas a mano.

# image.description
source: Insert one or more images.
es: Insertar una o más imágenes.

# _image.seeAlso
source: tt_content:imagewidth, tt_content:imageheight, tt_content:imageorient, tt_content:imageborder, tt_content:image_link, tt_content:image_zoom, tt_content:imagecols, tt_content:imagecaption, tt_content:image_frames, Using images ("Getting Started") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Using images (Animation) | FILE:EXT:welcome/modsub/ani_10.gif
es: tt_content:imagewidth, tt_content:imageheight, tt_content:imageorient, tt_content:imageborder, tt_content:image_link, tt_content:image_zoom, tt_content:imagecols, tt_content:imagecaption, tt_content:image_frames, Uso de imágenes ("Primeros pasos") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Uso de imágenes (Animación) | FILE:EXT:welcome/modsub/ani_10.gif

# image.image_descr
source: This shows all the options related to inserting images in Content Elements. Depending on user permissions, you may not be able to use all of them.
es: Muestra todas las opciones relacionadas con la inserción de imágenes en Elementos de Contenido. Dependiendo de los permisos de usuario, es posible que no pueda utilizarlos todos.

# imagewidth.description
source: Enter the width (in pixels) for displaying the image in the Frontend of your website.
es: Introduzca el ancho (en píxeles) para mostrar la imagen en el Frontend de su sitio web.

# imagewidth.details
source: The TypoScript template is normally configured with maximum image width so you shouldn't need to specify a width. In unique cases, this provides additional flexibility though.
es: La plantilla TypoScript se configura normalmente con el ancho máximo de la imagen, por lo que no es necesario especificar un ancho. Sin embargo, en casos únicos, esto proporciona flexibilidad adicional.

# imageheight.description
source: Enter the height (in pixels) for displaying the images in the Frontend of your website.
es: Introduzca la altura (en píxeles) para mostrar las imágenes en el Frontend de su sitio web.

# imageorient.description
source: Select the position and alignment of the images relative to the body text.
es: Seleccione la posición y la alineación de las imágenes en relación con el texto del cuerpo.

# imageorient.details
source: The positions above and below the body text are pretty straight forward. The options for "In text" mean that images are displayed with text wrapped around them. When you select this option the template will probably force the images into smaller dimensions to accommodate the width of the template and the width of the text. The bodytext will float <em>under</em> the image block when it reaches the end of the image block. In other words, the body text <em>wraps around</em> the image block. If you select "In text" below the "No wrap" divider, the body text will not float under the image block, but simply continue in its column. Apart from the visual difference there is a technical aspect as well. If you choose to allow the content to wrap the image block you will experience a strange phenomenon when you do not have enough bodytext to make it float around the image: subsequent content elements on the page will appear to be layered on top of the image block. However it's easily solved by changing the "In text" position to the equal value but below the "No wrap" divider.
es: Las posiciones por encima y por debajo del texto del cuerpo son bastante directas. Las opciones de "En texto" significan que las imágenes se muestran con texto alrededor de ellas. Cuando selecciona esta opción, la plantilla probablemente forzará las imágenes en dimensiones más pequeñas para acomodar el ancho de la plantilla y el ancho del texto. El texto del cuerpo flotará <em> debajo</em> del bloque de la imagen cuando llegue al final del bloque de la imagen. En otras palabras, el texto del cuerpo <em>envuelve alrededor de</em> el bloque de la imagen. Si selecciona "En texto" debajo del separador "Sin envoltura", el texto del cuerpo no flotará debajo del bloque de imagen, sino que simplemente continuará en su columna. Aparte de la diferencia visual, también hay un aspecto técnico. Si decide permitir que el contenido envuelva el bloque de la imagen, experimentará un fenómeno extraño cuando no tenga suficiente cuerpo de texto para que flote alrededor de la imagen: los elementos de contenido subsiguientes en la página aparecerán en capas encima del bloque de la imagen. Sin embargo, se resuelve fácilmente cambiando la posición "En texto" al mismo valor pero por debajo del divisor "Sin envoltura".

# imageborder.description
source: Displays a colored border around the images.
es: Muestra un borde coloreado alrededor de las imágenes.

# image_link.description
source: Enter a link for the image. For multiple images, separate the links with commas.
es: Introduzca un enlace para la imagen. Para múltiples imágenes, separe los enlaces con comas.

# image_link.details
source: By default all images share the same link. Your TypoScript template may be configured to allow a separate link for each image. If this is the case, you simply separate the links with a comma. See Page Content>Link below for details on syntax.
es: Por defecto, todas las imágenes comparten el mismo enlace. Su plantilla TypoScript puede estar configurada para permitir un enlace separado para cada imagen. Si este es el caso, simplemente separa los enlaces con una coma. Consulte el contenido de la página>Enlace a continuación para obtener más detalles sobre la sintaxis.

# image_zoom.description
source: When enabled, clicking an image will open a larger version in a popup window.
es: Cuando se activa, al hacer clic en una imagen se abrirá una versión más grande en una ventana emergente.

# image_zoom.details
source: This option overrides the value in the Links field.
es: Esta opción anula el valor del campo Enlaces.

# image_frames.description
source: Select special image framing options.
es: Seleccione opciones especiales de enmarcado de imágenes.

# imagecols.description
source: Set the number of columns when the images are displayed in the Frontend of the website.
es: Establezca el número de columnas cuando las imágenes se muestran en el Frontend del sitio web.

# imagecaption.description
source: Enter captions for the images. For multiple images, enter one caption per line.
es: Introduzca subtítulos para las imágenes. Para múltiples imágenes, introduzca un subtítulo por línea.

# imagecaption.details
source: By default, the caption is positioned below the images. However, your TypoScript template may be configured to allow individual image captions by setting "styles.content.imgtext.captionSplit=1" in your template constants. In this case, each line in this field will be the image caption of the corresponding image in the list. The caption text field is also used by the Content Element type "File Links" where each line represents a description of a file in the list.
es: De forma predeterminada, el título se coloca debajo de las imágenes. Sin embargo, la plantilla TypoScript puede configurarse para permitir pies de foto individuales estableciendo "styles.content.imgtext.captionSplit=1" en las constantes de la plantilla. En este caso, cada línea de este campo será el pie de foto de la imagen correspondiente en la lista. El campo de texto de pie de foto también es usado por el tipo de elemento de contenido "Enlaces de archivo" donde cada línea representa una descripción de un archivo en la lista.

# cols.description
source: Select a fixed number of table columns
es: Seleccionar un número fijo de columnas de tabla

# pages.description
source: Select a target page or multiple target pages.
es: Seleccione una página de destino o varias páginas de destino.
