Repository: JonEG/HighSchool
Catalog: var/labels/*/install/Resources/Private/Language/Report/*.locallang.xlf
Languages: es

# environment.status.title
source: System environment check
es: Verificación del entorno del sistema

# environment.status.value
source: %1$s Test(s)
es: %1$s Prueba(s)

# environment.status.message.error
source: The system environment check returned errors. Those errors will affect the functionality and stability of your TYPO3 CMS instance. Please check the install tool "System environment" for all details.
es: La comprobación del entorno del sistema devolvió errores. Esos errores afectarán la funcionalidad y la estabilidad de su instancia de TYPO3 CMS. Compruebe la herramienta de instalación del entorno del sistema para obtener todos los detalles.

# environment.status.message.warning
source: The system environment check returned warnings. Those warnings might have a negative effect on the functionality and stability of your TYPO3 CMS instance. Please check the install tool "System environment" for all details.
es: La comprobación del entorno del sistema devolvió advertencias. Esas advertencias pueden tener un efecto negativo en la funcionalidad y la estabilidad de su instancia de TYPO3 CMS. Compruebe la herramienta de instalación "Entorno del sistema" para obtener todos los detalles.

# environment.status.message.notice
source: The system environment check returned notices. Those should not affect the functionality and stability of your TYPO3 CMS instance. Please check the install tool "System environment" for all details.
es: La comprobación del entorno del sistema devolvió avisos. No deben afectar la funcionalidad y la estabilidad de su instancia de TYPO3 CMS. Compruebe la herramienta de instalación "Entorno del sistema" para obtener todos los detalles.

# status_fileSystem
source: File System
es: Sistema de archivos

# status_writable
source: Writable
es: Escribible

# status_missingDirectory
source: Required directory missing
es: Falta un directorio requerido

# status_nonExistingDirectory
source: Directory not existing
es: Directorio no existente

# status_recommendedWritableDirectory
source: Directory should be writable
es: El directorio debe ser escribible

# status_requiredWritableDirectory
source: Directory not writable
es: Directorio no escribible

# status_directoryDoesNotExist
source: %s does not exist.
es: %s no existe.

# status_directoryDoesNotExistCouldNotCreate
source: %s does not exist and could not be created.
es: %s no existe y no se pudo crear.

# status_directoryShouldAlsoBeWritable
source: Also note that it should be writable, if it did exist.
es: También tenga en cuenta que debe ser de escribible, si existiera.

# status_directoryShouldBeWritable
source: %s should be writable.
es: %s debe ser escribible.

# status_directoryMustBeWritable
source: %s must be writable.
es: %s debe ser escribible.

# status_remainingUpdates
source: Remaining updates
es: Actualizaciones restantes

# status_remoteFetchException
source: Could not fetch version matrix of TYPO3. Maybe this instance is blocked by a firewall?
es: No se pudo obtener la matriz de versión de TYPO3. Tal vez esta instancia está bloqueada por un firewall?

# status_isDevelopmentVersion
source: This version of TYPO3 seems to be a development version. Thus no update information exists.
es: Esta versión de TYPO3 parece ser una versión de desarrollo. Por lo tanto, no existe información de actualización.

# status_patchLevelNotFoundInReleaseMatrix
source: It seems that this TYPO3 version has never been released. Thus no update information exists.
es: Parece que esta versión de TYPO3 nunca ha sido lanzada. Por lo tanto, no existe información de actualización.

# status_versionOutdated
source: The TYPO3 version you're using is not supported anymore. You should update to a supported version.
es: La versión de TYPO3 que está utilizando ya no es compatible. Debe actualizar a una versión compatible.

# status_noAutomaticCheck
source: Automatic update checking failed, please check for updates manually.
es: Error en la comprobación automática de actualizaciones, verifique las actualizaciones manualmente.

# status_uptodate
source: Your TYPO3 version is up-to-date.
es: Su versión de TYPO3 está actualizada.

# status_installToolPassword
source: Install Tool Password
es: Contraseña de la herramienta de instalación

# status_installTool
source: Install Tool
es: Herramienta de instalación

# status_enabledPermanently
source: Enabled permanently
es: Habilitado permanentemente

# status_enabledTemporarily
source: Enabled temporarily
es: Habilitado temporalmente

# status_installEnabledTemporarily
source: The Install Tool is temporarily enabled. Delete the file "%s" when you have finished setting up TYPO3. If not used the Install Tool will be disabled automatically in %s minutes.
es: La herramienta de instalación está habilitada temporalmente. Elimine el archivo "%s" cuando haya terminado de configurar TYPO3. Si no se utiliza, la herramienta de instalación se desactivará automáticamente en %s minutos.
