Repository: JonEG/HighSchool
Catalog: var/labels/*/core/Resources/Private/Language/*.fileMessages.xlf
Languages: es

source: Cannot move folder "%s" into target folder "%s", because the target folder is already within the folder to be moved!
es: No se puede mover la carpeta "%s" en la carpeta de destino "%s", porque la carpeta de destino ya está dentro de la carpeta que se va a mover.

# FileUtility.CouldNotAccessAllNecessaryResources
source: Could not access all necessary resources. Source file or destination maybe was not within your mountpoints? T="%s", D="%s"
es: No se pudo acceder a todos los recursos necesarios. ¿El archivo de origen o destino quizás no estaba dentro de sus puntos de montaje? D="%s", O="%s"

# FileUtility.CouldNotDeleteDirectory
source: Could not delete directory! Is directory "%s" empty? (You are not allowed to delete directories recursively).
es: ¡No pudo eliminar el directorio! ¿Está vacío el directorio "%s"? (No se le permite eliminar directorios recursivamente).

# FileUtility.CouldNotDeleteDirectory1
source: Could not delete directory "%s"! There might be a problem with write permissions.
es: ¡No pudo eliminar el directorio "%s"! Puede haber un problema con los permisos de escritura.

# FileUtility.CouldNotDeleteFile
source: Could not delete file "%s". There might be a problem with write permissions.
es: No pudo eliminar el archivo "%s". Puede haber un problema con los permisos de escritura.

# FileUtility.DestinationExistedAlready
source: Destination "%s" already exists!
es: ¡El destino "%s" ya existe!

# FileUtility.DestinationPathWasNotWithinYourMountpoints
source: Destination path "%s" was not within your mountpoints!
es: ¡La ruta de destino "%s" no estaba dentro de sus puntos de montaje!

# FileUtility.DestinationWasNotADirectory
source: Destination "%s" was not a directory.
es: El destino "%s" no era un directorio.

# FileUtility.DirectoryCopiedTo
source: Directory "%s" copied to "%s".
es: Directorio "%s" copiado en "%s".

# FileUtility.DirectoryCreatedIn
source: Directory "%s" created in "%s".
es: Directorio "%s" creado en "%s".

# FileUtility.DirectoryMovedTo
source: Directory "%s" moved to "%s".
es: El directorio "%s" movido a "%s".

# FileUtility.DirectoryNotCreated
source: Directory "%s" not created. There might be a problem with write permissions in "%s"?
es: Directorio "%s" no fue creado. Puede haber un problema con los permisos de escritura en "%s".

# FileUtility.DirectoryRenamedFromTo
source: Directory renamed from "%s" to "%s".
es: Directorio renombrado de "%s" a "%s".

# FileUtility.DirectoryWasNotCopiedTo
source: Directory "%s" WAS NOT copied to "%s"! There might be a problem with write permissions
es: ¡Directorio "%s" NO fue copiado en "%s"! Puede haber un problema con los permisos de escritura.

# FileUtility.DirectoryWasNotMovedTo
source: Directory "%s" WAS NOT moved to "%s"! There might be a problem with write permissions
es: ¡Directorio "%s" NO fue movido a "%s"! Puede haber un problema con los permisos de escritura.

# FileUtility.DirectoryWasNotRenamed
source: Directory "%s" was not renamed! There might be a problem with write permissions in "%s"?
es: ¡Directorio "%s" no fue renombrado! Puede haber un problema con los permisos de escritura en "%s".

# FileUtility.ExtensionOfFileNameIsNotAllowedIn
source: Extension of file name "%s" is not allowed in "%s"!
es: ¡La extensión del archivo "%s" no está permitida en "%s"!

# FileUtility.ExtensionOfFileNameOrWasNotAllowed
source: Extension of file name "%s" or "%s" was not allowed!
es: ¡No se permitió la extensión del archivo "%s" o "%s"!

# FileUtility.ExtensionOfFileWasNotAllowed
source: Extension of file "%s" was not allowed!
es: ¡No se permitió la extensión del archivo "%s"!

# FileUtility.FileAlreadyExistsInFolder
source: File "%s" already exists in folder "%s"!
es: ¡El archivo "%s" ya existe en la carpeta "%s"!

# FileUtility.FileCopiedTo
source: File "%s" copied to "%s".
es: Archivo "%s" copiado en "%s".

# FileUtility.FileCreated
source: File created: "%s".
es: Archivo creado: "%s".

# FileUtility.FileExistedAlreadyIn
source: File existed already in "%s"!
es: ¡El archivo ya existía en "%s"!

# FileUtility.FileExtensionIsNotATextfileFormat
source: File extension "%s" is not a textfile format! (%s).
es: ¡La extensión del archivo "%s" no es un formato de archivo de texto! (%s).

# FileUtility.FileExtensionIsNotzip
source: File extension is not "zip".
es: La extensión del archivo no es "zip".

# FileUtility.FileMovedTo
source: File "%s" moved to "%s".
es: Archivo "%s" movido a "%s".

# FileUtility.FileNameWasNotAllowed
source: File name "%s" was not allowed!
es: ¡El nombre de archivo "%s" no estaba permitido!

# FileUtility.FileOrDestinationWasNotWithinYourMountpoints
source: File "%s" or destination "%s" was not within your mountpoints!
es: ¡El archivo "%s" o el destino "%s" no estaban dentro de sus puntos de montaje!

# FileUtility.FileOrDirectoryExistedAlready
source: File or directory "%s" already exists!
es: ¡El archivo o directorio "%s" ya existe!

# FileUtility.FileRenamedFromTo
source: File renamed from "%s" to "%s".
es: Archivo renombrado de "%s" a "%s".

# FileUtility.FileSavedToBytesMd5
source: File saved to "%s", bytes: %s, MD5: %s.
es: Archivo guardado en "%s", bytes: %s, MD5: %s.

# FileUtility.FileWasNotCopiedTo
source: File "%s" WAS NOT copied to "%s"! There might be a problem with write permissions.
es: ¡Archivo "%s" NO fue copiado a "%s"! Puede haber un problema con los permisos de escritura.

# FileUtility.FileWasNotCreated
source: File "%s" was not created! There might be a problem with write permissions in "%s"?
es: ¡Archivo "%s" no fue creado! Puede haber un problema con los permisos de escritura en "%s".

# FileUtility.FileWasNotRenamed
source: File "%s" was not renamed! There might be a problem with write permissions in "%s"?
es: ¡Archivo "%s" no fue renombrado! Puede haber un problema con los permisos de escritura en "%s".

# FileUtility.FileWasNotSaved
source: File "%s" was not saved! There might be a problem with write permissions.
es: ¡Archivo "%s" no fue guardado! Puede haber un problema con los permisos de escritura.

# FileUtility.FileWasNotSaved2
source: File "%s" was not saved! File extension rejected!
es: ¡Archivo "%s" no fue guardado! ¡Se ha rechazado la extensión del archivo!

# FileUtility.NoFileWasUploaded
source: No file was uploaded!
es: ¡No ha subido ningún archivo!

# FileUtility.NoFileWasUploadedForReplacing
source: No file was uploaded for replacing!
es: ¡No ha subido ningún archivo para reemplazarlo!

# FileUtility.NoNameForNewFolderGiven
source: No name for new folder given!
es: ¡Ningún nombre dado para la nueva carpeta!

# FileUtility.NoUniqueFilenameAvailableIn
source: No unique filename available in "%s"!
es: ¡Ningún nombre de archivo único disponible en "%s"!

# FileUtility.ReplacingFileTo
source: Replacing file "%s" to "%s".
es: Reemplazando el archivo "%s" con "%s".

# FileUtility.TargetAlreadyExists
source: Target "%s" already exists!
es: ¡El destino "%s" ya existe!

# FileUtility.TargetWasNotAFile
source: Target "%s" was not a file!
es: ¡El destino "%s" no era un archivo!

# FileUtility.TargetWasNotWithinYourMountpoints
source: Target was not within your mountpoints! T="%s".
es: ¡El destino no estaba dentro de sus puntos de montaje! D = "%s".

# FileUtility.TheFileDidNotExist
source: The file "%s" did not exist!
es: ¡El archivo "%s" no existía!

# FileUtility.TheFunctionToCopyAFileBetweenStoragesIsNotYetImplemented
source: The function to copy a file between storages is not yet implemented.
es: La función para copiar un archivo entre almacenes aún no se ha implementado.

# FileUtility.TheFunctionToCopyAFolderBetweenStoragesIsNotYetImplemented
source: The function to copy a folder between storages is not yet implemented.
es: La función para copiar una carpeta entre almacenes aún no se ha implementado.

# FileUtility.TheFunctionToMoveAFileBetweenStoragesIsNotYetImplemented
source: The function to move a file between storages is not yet implemented.
es: La función para mover un archivo entre almacenes aún no se ha implementado.

# FileUtility.TheFunctionToMoveAFolderBetweenStoragesIsNotYetImplemented
source: The function to move a folder between storages is not yet implemented.
es: La función para mover una carpeta entre almacenes aún no se ha implementado.

# FileUtility.TheUploadHasFailedNoUploadedFileFound
source: The upload has failed, no uploaded file found!
es: La subida ha fallado; ¡no se ha encontrado ningún archivo subido!

# FileUtility.TheUploadedFileExceedsTheSize-limit
source: The uploaded file "%s" exceeds the size-limit
es: El archivo subido "%s" supera el límite de tamaño.

# FileUtility.UnzippingFileIn
source: Unzipping file "%s" in "%s".
es: Descomprimiendo el archivo "%s" en "%s".

# FileUtility.UploadedFileCouldNotBeMoved
source: Uploaded file could not be moved! There might be a problem with write permissions in "%s"?
es: ¡No pudo mover el archivo subido! Puede haber un problema con los permisos de escritura en "%s".

# FileUtility.UploadingFileTo
source: Uploading file "%s" to "%s".
es: Subiendo el archivo "%s" a "%s".

# FileUtility.YouAreNotAllowedToAccessTheDirectory
source: You are not allowed to access the directory.
es: No se le permite acceder al directorio.

# FileUtility.YouAreNotAllowedToAccessTheFile
source: You are not allowed to access the file.
es: No se le permite acceder al archivo.

# FileUtility.YouAreNotAllowedToCopyDirectories
source: You are not allowed to copy directories.
es: No se le permite copiar directorios.

# FileUtility.YouAreNotAllowedToCopyFiles
source: You are not allowed to copy files.
es: No se le permite copiar archivos.

# FileUtility.InvalidFolderName
source: Invalid folder name "%s"!
es: ¡Nombre de carpeta "%s" no válido!

# FileUtility.YouAreNotAllowedToCreateDirectories
source: You are not allowed to create directories!
es: ¡No se le permite crear directorios!

# FileUtility.YouAreNotAllowedToCreateFiles
source: You are not allowed to create files!
es: ¡No se le permite crear archivos!

# FileUtility.YouAreNotAllowedToEditFiles
source: You are not allowed to edit files!
es: ¡No se le permite editar archivos!

# FileUtility.YouAreNotAllowedToMoveDirectories
source: You are not allowed to move directories.
es: No se le permite mover directorios.

# FileUtility.YouAreNotAllowedToMoveFiles
source: You are not allowed to move files.
es: No se le permite mover archivos.

# FileUtility.YouAreNotAllowedToOverride
source: You are not allowed to override "%s"!
es: ¡No se le permite reemplazar "%s"!

# FileUtility.YouAreNotAllowedToRenameDirectories
source: You are not allowed to rename directories!
es: ¡No se le permite cambiar el nombre de los directorios!

# FileUtility.YouAreNotAllowedToRenameFiles
source: You are not allowed to rename files!
es: ¡No puedes cambiar el nombre de los archivos!

# FileUtility.YouAreNotAllowedToUnzipFiles
source: You are not allowed to unzip files.
es: No se le permite descomprimir archivos.

# FileUtility.YouAreNotAllowedToUploadFiles
source: You are not allowed to upload files!
es: ¡No se le permite subir archivos!

# FileUtility.YouDontHaveFullAccessToTheDestinationDirectory
source: You don't have full access to the destination directory "%s"!
es: ¡No tiene acceso completo al directorio de destino "%s"!
